
🏗️ Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.supernode[0].proxmox_vm_qemu.supernode is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "supernode" {
      - ciuser                    = "admin" -> null
      + default_ipv4_address      = (known after apply)
      ~ define_connection_info    = true -> false
      - disk_gb                   = 0 -> null
      ~ id                        = "pm2/qemu/119" -> (known after apply)
        name                      = "supernode-dev-0"
      + nameserver                = (known after apply)
      - qemu_os                   = "other" -> null
      ~ reboot_required           = false -> (known after apply)
      + searchdomain              = (known after apply)
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      ~ unused_disk               = [] -> (known after apply)
      + vmid                      = (known after apply)
        # (32 unchanged attributes hidden)

      ~ disk {
          ~ file               = "base-9001-disk-0/vm-119-disk-0" -> (known after apply)
          ~ format             = "raw" -> (known after apply)
          + media              = (known after apply)
          ~ size               = "2G" -> "4G"
          ~ slot               = 0 -> (known after apply)
          ~ storage_type       = "rbd" -> (known after apply)
          ~ volume             = "system:base-9001-disk-0/vm-119-disk-0" -> (known after apply)
            # (21 unchanged attributes hidden)
        }

      ~ network {
          ~ macaddr   = "3A:93:C3:E3:2D:82" -> (known after apply)
          - mtu       = 0 -> null
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.supernode[1].proxmox_vm_qemu.supernode is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "supernode" {
      - ciuser                    = "admin" -> null
      + default_ipv4_address      = (known after apply)
      ~ define_connection_info    = true -> false
      - disk_gb                   = 0 -> null
      ~ id                        = "pm2/qemu/120" -> (known after apply)
        name                      = "supernode-dev-1"
      + nameserver                = (known after apply)
      - qemu_os                   = "other" -> null
      ~ reboot_required           = false -> (known after apply)
      + searchdomain              = (known after apply)
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      ~ unused_disk               = [] -> (known after apply)
      + vmid                      = (known after apply)
        # (32 unchanged attributes hidden)

      ~ disk {
          ~ file               = "base-9001-disk-0/vm-120-disk-0" -> (known after apply)
          ~ format             = "raw" -> (known after apply)
          + media              = (known after apply)
          ~ slot               = 0 -> (known after apply)
          ~ storage_type       = "rbd" -> (known after apply)
          ~ type               = "virtio" -> "scsi"
          ~ volume             = "system:base-9001-disk-0/vm-120-disk-0" -> (known after apply)
            # (21 unchanged attributes hidden)
        }

      ~ network {
          ~ macaddr   = "8E:AA:CE:5D:01:61" -> (known after apply)
          - mtu       = 0 -> null
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```